{
    "status": true,
    "message": "",
    "data": {
        "info": [{
                "zhTitle": "关于秘技",
                "zhContent": "秘技现在不用发邮件了，我搞了一个博客站点，地址：www.bluewhalevpn.com，密码：bluewhale123。需要的上去看，我看看后面更新一下图文说明，还有台中服务器挂了，我在和服务器商交涉中，造成不便，实在抱歉。\n最后感谢你们一路相伴.谢谢你们！",
                "enTitle": "Sorry！",
                "enContent": "During this time, the network is unstable, and many servers are slow. I suggest you use the advanced server. If you want to use the advanced server, you can check out my blog, but currently only Chinese, I will increase the English version of the cheats in the future. The following is my blog address: www.bluewhalevpn.com, password: bluewhale123. Thank you for trying to understand and all your support. I really appreciate it."
            },{
                "zhTitle": "建议大家重启一下手机",
                "zhContent": "更新了一下服务器！如果遇到无法连接，建议大家重启一下手机。",
                "enTitle": "Update server！",
                "enContent": "Unable to connect, it is recommended to restart the phone！"
            },{
                "zhTitle": "我也很绝望！",
                "zhContent": "好多服务器商的IP都给封了，现在申请的服务器基本都是用不了，只能在现有的服务器基础上维护，或者等新的服务器商申请下来，我在更新一波服务器。这个月一直好卡，我自己也好难受。而且这两天谷歌给的广告单价也只有之前的三分之一不到。哎！生活还是要继续，我还要继续完善应用，或者等哪天应用真的完善好了，我看看收益怎么样。重新制定一些机制。服务器后台已经在完善中，还有把延迟机制更新回来，还有把老版本的模式再加来，多一种选择。你们也可以更方便的使用高级服务器。这该死的6月！！！最后，祝每个为家庭奋斗的父亲！父亲节快乐！",
                "enTitle": "I'm desperate too！",
                "enContent": "The IP of a lot of server business gave close, the server that applies for now basically cannot be used, can maintain on existing server foundation only, or wait for new server business to apply for to come down, I am updating server of a wave. This month has been good card, I also feel bad. In addition, the unit price of Google advertising in these two days is less than one third of the previous price. Ah! Life has to go on, I have to continue to improve the application, or wait for one day when the application is really perfect, I will see how the revenue. Reinstitute some mechanisms. Server background has been improved, and the delay mechanism to update back, and the old version of the mode to add, one more choice. You can also use advanced servers more easily. Damn June!!! Finally, I wish every father who fights for his family! Happy father's day!"
            }
        ]
    }
}
