{
    "status": true,
    "message": "",
    "data": {
        "info": [
            {
                "zhTitle": "问题总汇0419",
                "zhContent": "这能不能不要老问我搞那么多广告干什么，我真的很无奈啊！也请不老拿别人和蓝鲸比，你说别人好，别人方便，这我也认。但是你们说的广告多，这你为什么会觉得蓝鲸广告多？无非就是不肯花时间反而想得到更多。别忘了蓝鲸也是有一组免费不用看广告的服务器。如果你不想花点时间，你用免费的就好了。不花时间，你凭什么和我们肯花时间的人享有更多选择，你凭什么说支持蓝鲸。我做免费，我也要做有原则的免费，可能这样很招人讨厌，但是至少我留住了那些肯花时间的人，恰恰是这帮肯花时间的人，他们才是蓝鲸存活下去的支撑。我知道现在广告是有点多，所以我弄了所谓的秘技，我也发了说明，你也不肯花点时间去折腾，去弄明白原理，理解了，一天花不上一个广告的时间，就能解锁全部服务器，反倒老发邮件说，学学别人的应用做得多方便，我也老实告诉你，其实现在服务器的广告基本都会自动跳过的，因为广告商并没有给我太多广告资源，就是有广告的情况下，收益也是甚微，服务器类型的广告收益是最少的，但是我为什么还要这么设置，无非就是设置一个槛，区分用户，你付出更多时间，我给你更多选择，仅此而已。\n我就真的想不懂，为什么会在广告的问题上一直持续这么久，这你们不是更应该抱怨服务器不好，要求我增加功能才是真么，做为用户如果理解开发者，就应该用用户的角度去看待一个应用，UI上，操作上，去给我提意见。蓝鲸这类的应用，每天都是需要花销服务器来维护，才能持续，而且现在广告机制也在看有没有收益，能不能持续。世间安得两全法，不负如来不负卿？吐槽那么多，如果想简单解锁，就用秘技吧。蓝鲸也一样欢迎，因为你肯花时间去理解，去掌握，无广告的蓝鲸欢迎你使用。就不要做那种即不肯花时间去看广告，又不肯花时间去用秘技，而有时间发邮件和我说广告多的人，这种人网络我不喜欢，现实我也不喜欢。最后谢谢那些发邮件告诉我应用不稳定，告诉我应用Bug的朋友，谢谢你！\n\n以后问题会在这个公布栏进行反馈\n\n1、关于应用运行一段时间会断线问题。\n答：最近收到几个邮件说应用会运行一段时间断线，有的人说半个小时，有的人说一个小时内，有人说几十分钟，关于这个问题，你们遇到可以邮件反馈一下，具体写上什么手机，安卓版本多少，这样我可以排除什么问题，现在已知可能是速鱼留下来的Bug，之前速鱼设置过保护机制，应用运行一段时间会断开，但是之前速鱼设置是1个小时，所以可能是这个问题，具体等你们多反馈，我在整体排除一遍。\n\n2、关于服务器费用问题。\n答：收到几封邮件来说，我说会发公告告诉你们，现在一台普通服务器一个月的费用是20美金，因为共享带宽，所以大多数晚上是高峰期，会不稳定。高级服务器是独立的服务器，个人租的整台服务器，独享带宽，独享性能，一台一个月费用是120美金，所以大多数晚上如果蓝鲸用户少用的情况下，应该会比较稳定。但是网络这东西，谁知道呢。自己用的电信200M，一到下雨天，网络也异常慢，所以我不是说让大家理解我服务器慢，服务器烂不是我的借口，我是想让你们告诉，有时候体验不好可以发邮件告诉我，我可以改进。我可以知道多少用户该配多少服务器合适，比较我的钱也是钱，也是靠上班挣来的，我只能满足一部分人。好了，我不哭穷，笑着笑着突然哭了。\n\n3、关于开发PC端和iOS问题。\n答：我只是一个弱小可怜又无助但很能吃的安卓程序猿，所以PC端我不懂怎么开发，对于iOS，我可能还有点点了解，所以iOS就后面看吧。\n\n4、关于全局\n答：前期稳定性基本ok了，接下来全局是我的一个重点的方向，全局做好后，就能真正体现每个服务器的价值了，真正实现隐藏本地IP功能，真正实现访问全球受限网站问题。等等我吧，全局可能会迟到，但全局不可能不到！\n\n5、关于手机有时候显示已连接，但是没有数据传输问题。\n答：这排除我会发公告说服务器维护的情况下，一般如果选择服务器后，显示已连接，但是没有数据传输，而且全部服务器都一样，这时候你只要重启一下手机。一般都是能解决。如果不能解决这个问题，请给我留言，一般我也解决不了！我只是陪你聊聊天，舒缓舒缓一下情绪！",
                "enTitle": "Problem summary 0419",
                "enContent": "In the future, the problem will be feedback in this bulletin board\n\n1, and the application will run for a period of time. \n A: I recently received several emails saying that the application will run for a period of time. Some people say that for half an hour, some people say that within an hour, some people say dozens of minutes. On this issue, you can get mail. Feedback, specifically what mobile phone, Android version, so I can rule out what problems, now known to be a bug left by the fast fish, before the speed fish set protection mechanism, the application will run for a while will be disconnected, but before The speed fish setting is 1 hour, so it may be this problem, specifically waiting for your feedback, I will exclude it in the whole. \n\n2, about server costs. \n A: I received a few emails, I said that I will send an announcement to tell you that the cost of a regular server for a month is 20 dollars. Because of the shared bandwidth, most nights are peak and unstable. The advanced server is a stand-alone server. The entire server is rented by individuals. It has exclusive bandwidth and exclusive performance. The cost per month is 120 dollars, so most of the night, if the blue whale users use less, it should be stable. But who knows about the Internet? I used the telecom 200M. When it rains, the network is also very slow, so I am not saying that everyone understands that my server is slow. The server is not an excuse for me. I want you to tell that sometimes you can send an email if you have a bad experience. I can improve. I can know how many users should match the number of servers, compare my money is also money, but also earned by going to work, I can only meet some people. Ok, I don't cry, I laugh and suddenly cry. \n\n3, about developing PC and iOS issues. \n A: I am just a small, poor and helpless but very good Android program, so I don't know how to develop on the PC side. For iOS, I may have some understanding, so iOS will look at it later. \n\n4, About the global \n A: The stability of the previous period is basically ok, then the global is a key direction of me. After the global is done, it can truly reflect the value of each server, and truly realize the hidden local IP. Features that truly enable access to globally restricted websites. Wait for me, the whole world may be late, but the whole world is impossible! \n\n5, About the phone sometimes shows that it is connected, but there is no data transmission problem. \n A: This excludes me from issuing an announcement that the server is maintained. Generally, if the server is selected, the connection is displayed, but there is no data transmission, and all the servers are the same. At this time, you only need to restart the phone. Generally can solve. If you can't solve this problem, please leave a message, generally I can't solve it! I just chat with you to soothe your mood!"
            },{
                "zhTitle": "跳过广告秘技",
                "zhContent": "升级了，听说秘技和1.04版更配，一天出一版，你们不会骂我吧，昨天到现在好多人问说秘技不是很适用，说好多广告没有加载出来，现在我也重新优化了广告加载问题，更方便秘技的使用，还有那些不清楚秘技的方法，也可以发邮件私问我。暂时不准备公开公布。具体好不好用，结合自己情况，因为后面会加更多服务器，秘技应该会大大减少时间，不喜勿喷。2019-04-18，蓝鲸敬上！。\n\nps：需要秘技，发邮件的话，发蓝鲸和速鱼的邮件都会回复，发速鱼我手机看到能马上回复，发蓝鲸就要等我闲的时候开电脑上去看，看到才能回复，所以急的话就发速鱼邮箱，不急就发蓝鲸邮箱。",
                "enTitle": "Hello world",
                "enContent": "Hello world！"
            },
            {
                "zhTitle": "有事相求",
                "zhContent": "我有位朋友，他也是开发者，他昨天问我，说帮他推广一款小应用（其实他的UI有些都是我帮他做的），答应给我买一台高级服务器一个月的费用(120美金)，犹豫了一天，后面被他的真诚打动（他把他的经历和想法都和我说了），后面我答应他试试看，在公告帮他打个小广告，后面我说免费帮他打打小广告可以，但是我不保证有什么安装量，有什么评论。他也说了，他只是想冲冲量，后面怎么发展就看天了。到刚刚，和他达到协议，按照一个下载不删的情况下，一个用户给我1人民币的方式去算，等到够120美金，就给我钱。\n\n如果可以，有空就帮帮忙，下载《小黄灯》，随便就留留好评，等拿到钱，我就去给大家买多一台高级服务器试试看。我也不强求，或许这也是一种方式，我不会考虑付费，但是我可以考虑去拉赞助，这或许也是寻求生存的一些小希望。\n\n可以去谷歌商店搜索“小黄灯”他是一款可以表白的led小应用，等多了一台高级服务器再把这小应用删就可以。2019-04-19，蓝鲸先谢谢大家！",
                "enTitle": "Partial server maintenance",
                "enContent": "Part of the server maintenance, maintenance, will increase the number of ordinary servers！2019-04-17"
            },
            {
                "zhTitle": "蓝鲸的优化方向",
                "zhContent": "谢谢刚刚大兄弟提的建议，说如果23点看完全部广告，凌晨又要重新看一遍，这确实是一个问题，之前我也考虑过，只是鉴于目前没有登录系统，我也做不了统计，所以就只能这样先，不过我也想了其他方案，后面会做一些调整。\n 接下来蓝鲸的优化方向是这样\n 1、把目前遇到的Bug修复完上一版。\n 2、把全局功能优化好，重新加回来，这样就可以实现换Ip。\n 3、优化广告机制，比如说今天连续看完广告的，隔天就可以免看，或者少看，具体要看技术上怎么实现。不是我想让你们看多少广告，而是我觉得现在的广告机制是为了保护肯花时间的人有更好的服务器用，如果都是一样打开就能用，很容易造成拥挤，这样高级服务器其实就没有意义了，因为免广告，大家其实都会直接就跳过去选择高级服务器，这样累的还是我，本身就没有费用购买更多服务器，然后高级服务器还卡，你们都删了，剩下的大家都可以脑补，我不想我花了那么多时间的东西白费掉。或者哪位富二代突然发邮件告诉我说，给我打一个全年份，几十台高级服务器的费用，好了，那时候蓝鲸还有广告，我就和蓝鲸一个姓。",
                "enTitle": "Bluewhale optimization direction",
                "enContent": "Thank you for the advice of the big brother, saying that if you look at the full advertisement at 23 o'clock, you have to look back again in the early morning. This is indeed a problem. I have considered it before. Just because there is no login system, I can't do statistics, so I can't do statistics. It can only be like this first, but I also think about other options, and I will make some adjustments later. \n Next, the optimization direction of the blue whale is like this. \n 1. Fix the current bug to the previous version. \n 2, optimize the global function, add it back, so you can change Ip. \n 3, optimize the advertising mechanism, for example, today, after reading the advertisements in succession, you can watch it the next day, or watch it less, depending on how the technology is implemented. I don't think I want you to see how many advertisements, but I think the current advertising mechanism is to protect people who spend their time with better servers. If they are all open, they can be used easily, so it is easy to cause congestion. There is no point, because free of advertising, everyone will actually jump directly to select the advanced server, so tired or me, there is no cost to buy more servers, and then the advanced server card, you have deleted, the rest of everyone I can make up for it, I don't want to spend so much time on my time. Or which rich second generation suddenly sent an email telling me to give me a full year, dozens of advanced server fees, well, then blue whales have ads, I will be a surname with blue whales."
            }
        ]
    }
}
