{
    "status": true,
    "message": "",
    "data": {
        "info": [{
                "zhTitle": "我是谁，我在哪！！",
                "zhContent": "今天看了几位热心的用户给蓝鲸留言了，有人提议起：水滴鱼Tuna/Shark、白鲸（好像有人起了）、虎鲸、比目鱼、水母、胖头鱼等。蓝鲸觉得比目鱼这个名字好像不错，那我们新应用的名字就叫做虎鲸吧！哎呀！好像shark这名字也不错！啊啊啊啊啊！头痛！我是什么星座来的,怎么也犯了选择困难症了！这两天我看看比目鱼有没有比较好看的图标，我拿来修改修改。或者找不到的话，我在想想有没有其他好一点的名字。还有速鱼重新上线了，修改了一些东西，但是现在服务器可以用了，看了速鱼的用户还有人留言，我也就修复一下，更新了一版，这样也好，多一个应用，多一点收入，这样服务器费用负担就没那么重。请原谅我的不专心！只是免费道路上困难重重！我也只好找多一些方法来解决经费问题。不过我会一直把免费理念坚持下去。广告我也会做到大家都能接收的范围。至于好多人留言说要给我捐款。哈哈哈！我也重申一下。蓝鲸的服务器经费靠广告还是能维持，一直让我心情不好的，是那些天天吵着我说广告多，是那些不体谅开发者的人，是那些不理青红皂白反手就一个人差评的人。其实也不是对蓝鲸开发者（我）！更多还有应用商店上的其他开发者。我们其实那么辛苦图钱说不上，图啥呢！说我洗白也好！天天那么多逼话。哈哈哈！我也不理了！最后打一下广告！速鱼重新上线了！我需要一点点用户！需要突破广告商的数量要求！有空的朋友可以帮我下一下！谢谢了！搜索“速鱼vpn”哈哈哈我的第一个应用。最后趁中秋假期还没结束！我祝各位大爷！哥哥！姐姐！花好月圆人团圆！。",
                "enTitle": "The new application！",
                "enContent": "Prepare to develop a new VPN software.!"
            },{
                "zhTitle": "中秋节快乐！！",
                "zhContent": "祝大家中秋节快乐,阖家幸福!鉴于这段时间大家的反馈，蓝鲸准备推出一款新VPN，轻广告！新姿态，船新机制，大家拭目以待，现在求大家赐个名,最好也是海洋生物。蓝鲸再此谢谢各位。",
                "enTitle": "Happy Mid-Autumn festival！",
                "enContent": "Wish everyone happy Moon Festival!"
            },{
                "zhTitle": "我太难了！！",
                "zhContent": "高级服务器开放没几天，好多服务器都快没有流量了！而且人数多也把服务器快挤爆了！这...我要怎么办啊！流量没了！我没钱买！又一堆人骂我！像是我收了费一样！没有办法！我只能重新把广告加回来！横竖都是死！我要选择舒服点的死法。所以抱歉了各位！今天又要重新调整过来，我已经把广告调整到大家能容忍的范围，真希望能继续维持下去。那条胖鲸已经日渐消瘦！再见！我要继续开发我的游戏了！祝天下所有老师（包括硬盘里面的老师）！教师节快乐！！",
                "enTitle": "Sorry！Server maintenance！",
                "enContent": "Maintenance, maintenance will refresh the ads, sorry!."
            },{
                "zhTitle": "关于秘技",
                "zhContent": "秘技现在不用发邮件了，我搞了一个博客站点，地址：www.bluewhalevpn.com，密码：bluewhale123。需要的上去看，我看看后面更新一下图文说明，还有台中服务器挂了，我在和服务器商交涉中，造成不便，实在抱歉。\n最后感谢你们一路相伴.谢谢你们！",
                "enTitle": "Sorry！",
                "enContent": "During this time, the network is unstable, and many servers are slow. I suggest you use the advanced server. If you want to use the advanced server, you can check out my blog, but currently only Chinese, I will increase the English version of the cheats in the future. The following is my blog address: www.bluewhalevpn.com, password: bluewhale123. Thank you for trying to understand and all your support. I really appreciate it."
            },{
                "zhTitle": "蓝鲸排查手册",
                "zhContent": "大家好！我叫蓝鲸，答疑解难一时爽，一直答疑解难，一直爽。不过今天有点累了！我不答了！！！！刚刚修复了几个不能用的服务器。还有一些没来得及修复，预计这几天弄好。如果在使用的过程中遇到不能使用的情况，请按照以下流程试试。\n\n1、如果提示无网络的情况，大多数是因为当前网络无法加载蓝鲸的远程服务器的配置。需要退出重新启动蓝鲸（要退得干干净净的那种)。然后再试试，或者换换wifi、4G切换试试。\n\n2、如果遇到全部服务器的延迟测试都不可用，一般这种有两种可能，一是当前服务器全部给墙了，这种情况只要清除蓝鲸的缓冲（要清得干干净净的那种）。另外一种就是把手机重启一下。应该都能解决问题。\n\n3、关于掉线问题，蓝鲸现在设置为2个小时断一次线。如果是其他时间，一般是手机的查杀问题，或者其他手机机制问题，这一点我无法保证每款手机都对蓝鲸是友好的。\n\n4、蓝鲸的广告凌晨会重置，想要使用高级服务器，每天都需要使用秘籍，或者模式B，从头看到尾，就能自动开启。这点实在抱歉。为了生存望见谅。我能向大家保证。蓝鲸广告的所得大部分是用在服务器的购买上面。如果以后坚持不下去，我会提前和大家说。\n\n5、三天登陆问题，有人说可以，那就应该是正常的。我这几天自己也试试看。\n\n6、简单来说，如果遇到不能用的情况下，第一就是退出重新登录，第二就是清除蓝鲸缓存，第三就是重启手机。如果以上三步都无法连接，那我就真的没办法了！因为我能确保大部分服务器都能用！如果都是不能用，可能就是手机兼容问题了。/n/n/n无法使用就重启手机！或者清除蓝鲸缓存。",
                "enTitle": "Update server！",
                "enContent": "Unable to connect, it is recommended to restart the phone！"
            }
        ]
    }
}
