{
    "status": true,
    "message": "",
    "data": {
	"zhNotice":"大家好！我是蓝鲸！一个在墙内挣扎的程序员！蓝鲸被迫已经更新到1.15版本了！你们能看到我这个公告，蓝鲸在此谢谢你们的支持！github上我的服务器列表信息给封锁了！导致这段时间一直显示网络不可用。本该在唱凉凉的蓝鲸，不甘心！这段时间用户流失好多，谷歌的评分也一落千丈！不过真的非常感谢你们！希望一切都是最好的安排！！！感谢！",
	"enNotice":"Everybody is good! I am the developer of blue whale. Github server has been closed recently. Now it needs to be updated to version 1.15 before it can be used normally. Thank you!",
        "adList": [],
        "info": [
             {
                "zhTitle": "11-06！紧急更新",
                "zhContent": "github服务器给封了，导致服务器列表获取不了，这段时间大部分人应该都会显示网络不可用。现在我已经弄了一个新的机制，双重保障，不过要新版本才能获取，这是一个尴尬的问题，现在无法获取服务器就更新不了，如果谷歌更新不了，请移步到我的博客去下载更新，麻烦了各位。近期有点累！蓝鲸感觉已经是凉凉的了！哈哈哈！不过只有你们不放弃我。我就会继续更新下去。一直免费下去。。附上蓝鲸的网站上面有下载更新地址：\nwww.bluewhalevpn.com。",
                "enTitle": "11-06! Emergency update！",
                "enContent": "The github server has been blocked, making the list of servers unavailable. Most people will probably show that the network is unavailable at this time. Now I have made a new mechanism, double security, but to access the new version, this is an embarrassing problem, can not access the server now can not update, if the Google update, please move to my blog to download the update, thank you. A little tired recently! The blue whale feels cool already! Ha ha ha! But only you don't give up on me. I'll keep updating. Keep it free.."
            },{
                "zhTitle": "10-24！程序员节！",
                "zhContent": "1024！！！赶紧祝我程序员节日快乐~哈哈哈！今天心情略好！高级服务器更新了！虽然也遇到很多不如意的事，但是总算更新了一些。新应用的图标也设计好了！新应用的名字叫“逗鲨”就是豆沙包那个逗鲨。蓝鲸喜欢吃甜甜圈，逗鲨喜欢吃豆沙包！！！游戏最近搁浅了，遇到些问题，我也在慢慢修复。以后可以在游戏和大家互动了，大家可以来和我一决高低。关于蓝鲸这些日子遭遇了什么，我只是想说一个人的弊端就是遇到问题，我要花很多时间去解决，像这次，已经一个月了，我才慢慢在恢复，哈哈哈，想想挺累的，不过我也没说放弃，毕竟免费，也希望大家允许我偷偷懒。最后谢谢大家的体谅。蓝鲸尽人事，然后听天命，希望不要那么快又给封杀。高级服务器很贵，东凑西凑才挤出这几台。各位慢用！我走了！。",
                "enTitle": "10-24！！",
                "enContent": "The advanced server is back."
            },
            {
                "zhTitle": "谍照来了2019-10-11！！",
                "zhContent": "恢复了一些服务器，高级服务器几个服务器商因为这次封杀，他们都对我账户限制了，发邮件说我搭建的ss给多人使用。我要在等等，一有新消息我会在公告公布的。谢谢大家。还有胖鲸的游戏谍照已经发我的网站上面了，欢迎各位看官给点意见。附上蓝鲸的网站：\nwww.bluewhalevpn.com。",
                "enTitle": "Server update！",
                "enContent": "Servers will be updated and more will be added!."
            },
            {
                "zhTitle": "诸事不顺！10-09！！",
                "zhContent": "哎！诸事不顺！！不过生活还是要继续！加油吧！接下来我会慢慢恢复服务器。谢谢大家能陪胖鲸坚持下来。还有胖鲸开发的小游戏也即将上线。让你们了解这条胖鲸是怎么走上一条肥胖的不归路！后续会在网站更新一些制作过程的图片。",
                "enTitle": "Welcome to use！",
                "enContent": "Welcome to use!."
            }
        ]
    }
}
