{
    "status": true,
    "message": "",
    "data": {
        "info": [
            {
                "zhTitle": "跳过广告秘技",
                "zhContent": "升级了，听说秘技和1.04版更配，一天出一版，你们不会骂我吧，昨天到现在好多人问说秘技不是很适用，说好多广告没有加载出来，现在我也重新优化了广告加载问题，更方便秘技的使用，还有那些不清楚秘技的方法，也可以发邮件私问我。暂时不准备公开公布。具体好不好用，结合自己情况，因为后面会加更多服务器，秘技应该会大大减少时间，不喜勿喷。2019-04-18，蓝鲸敬上！。\n\nps：需要秘技，发邮件的话，发蓝鲸和速鱼的邮件都会回复，发速鱼我手机看到能马上回复，发蓝鲸就要等我闲的时候开电脑上去看，看到才能回复，所以急的话就发速鱼邮箱，不急就发蓝鲸邮箱。",
                "enTitle": "Hello world",
                "enContent": "Hello world！"
            },
            {
                "zhTitle": "有事相求",
                "zhContent": "我有位朋友，他也是开发者，他昨天问我，说帮他推广一款小应用（其实他的UI有些都是我帮他做的），答应给我买一台高级服务器一个月的费用(120美金)，犹豫了一天，后面被他的真诚打动（他把他的经历和想法都和我说了），后面我答应他试试看，在公告帮他打个小广告，后面我说免费帮他打打小广告可以，但是我不保证有什么安装量，有什么评论。他也说了，他只是想冲冲量，后面怎么发展就看天了。到刚刚，和他达到协议，按照一个下载不删的情况下，一个用户给我1人民币的方式去算，等到够120美金，就给我钱。\n\n如果可以，有空就帮帮忙，下载《小黄灯》，随便就留留好评，等拿到钱，我就去给大家买多一天高级服务器试试看。我也不强求，或许这也是一种方式，我不会考虑付费，但是我可以考虑去拉赞助，这或许也是寻求生存的一些小希望。\n\n可以去谷歌商店搜索“小黄灯”他是一款可以表白的led小应用，等多了一台高级服务器再把这小应用删就可以。2019-04-19，蓝鲸先谢谢大家！",
                "enTitle": "Partial server maintenance",
                "enContent": "Part of the server maintenance, maintenance, will increase the number of ordinary servers！2019-04-17"
            },
            {
                "zhTitle": "蓝鲸的优化方向",
                "zhContent": "谢谢刚刚大兄弟提的建议，说如果23点看完全部广告，凌晨又要重新看一遍，这确实是一个问题，之前我也考虑过，只是鉴于目前没有登录系统，我也做不了统计，所以就只能这样先，不过我也想了其他方案，后面会做一些调整。\n 接下来蓝鲸的优化方向是这样\n 1、把目前遇到的Bug修复完上一版。\n 2、把全局功能优化好，重新加回来，这样就可以实现换Ip。\n 3、优化广告机制，比如说今天连续看完广告的，隔天就可以免看，或者少看，具体要看技术上怎么实现。不是我想让你们看多少广告，而是我觉得现在的广告机制是为了保护肯花时间的人有更好的服务器用，如果都是一样打开就能用，很容易造成拥挤，这样高级服务器其实就没有意义了，因为免广告，大家其实都会直接就跳过去选择高级服务器，这样累的还是我，本身就没有费用购买更多服务器，然后高级服务器还卡，你们都删了，剩下的大家都可以脑补，我不想我花了那么多时间的东西白费掉。或者哪位富二代突然发邮件告诉我说，给我打一个全年份，几十台高级服务器的费用，好了，那时候蓝鲸还有广告，我就和蓝鲸一个姓。",
                "enTitle": "Bluewhale optimization direction",
                "enContent": "Thank you for the advice of the big brother, saying that if you look at the full advertisement at 23 o'clock, you have to look back again in the early morning. This is indeed a problem. I have considered it before. Just because there is no login system, I can't do statistics, so I can't do statistics. It can only be like this first, but I also think about other options, and I will make some adjustments later. \n Next, the optimization direction of the blue whale is like this. \n 1. Fix the current bug to the previous version. \n 2, optimize the global function, add it back, so you can change Ip. \n 3, optimize the advertising mechanism, for example, today, after reading the advertisements in succession, you can watch it the next day, or watch it less, depending on how the technology is implemented. I don't think I want you to see how many advertisements, but I think the current advertising mechanism is to protect people who spend their time with better servers. If they are all open, they can be used easily, so it is easy to cause congestion. There is no point, because free of advertising, everyone will actually jump directly to select the advanced server, so tired or me, there is no cost to buy more servers, and then the advanced server card, you have deleted, the rest of everyone I can make up for it, I don't want to spend so much time on my time. Or which rich second generation suddenly sent an email telling me to give me a full year, dozens of advanced server fees, well, then blue whales have ads, I will be a surname with blue whales."
            }
        ]
    }
}
