{
    "status": true,
    "message": "",
    "data": {
        "info": [
            {
                "zhTitle": "广告方式征集活动",
                "zhContent": "鉴于这几天，你们反馈的广告问题，确实有点多，但是我又没有找他其他好的方式，或者你们有什么好的广告方式可以和我说，我换成你们想要的方式，或者我开一个秘籍通道，只有你们这样操作就可以跳过广告，当然这种秘籍我不会在公众公开，后面需要的可以私密我，再或者你们有其他想法就和我说。\n今天也想了挺多，作为一个为公众服务的应用，就应该接受大家的意见，如果脱离用户体验，这一切都将毫无意义，所以你们给低星的评价，我接受。。",
                "enTitle": "Hello world",
                "enContent": "Hello world！"
            },{
                "zhTitle": "提示“系统维护中”请进",
                "zhContent": "连接不成功，提示系统维护中，你们重新把蓝鲸的数据缓存全部清空，再次连接就可以了！目前找不到其他方法，后面看怎么改掉这个bug。谢谢使用！\n\n划重点，要考。 系统维护中  数据缓存 全部清空",
                "enTitle": "Prompt “System Maintenance”",
                "enContent": "The connection is not successful, prompting the system maintenance, you can completely empty the blue whale data cache, and connect again! No other methods are currently available. See how to get rid of this bug later！"
            },
            {
                "zhTitle": "正式版Bug",
                "zhContent": "正式版上线后发现好多Bug，晚上一直在想办法修复，我会尽快把现有的问题修复，还有感谢那几位改评论的大兄弟，在此谢谢你们了，不好意思，我昨天看完确实有点气，应用新上线，我可能有点小期待，原谅的我玻璃心。还有遇到bug的朋友可以截图发邮件我，这样我比较好修复，因为我自己手机测试了没问题才上线的，但是安卓的机型太多了，只有上线才能真正发现问题。等等我吧，如果发现蓝鲸不如速鱼，就在等等蓝鲸修复好，蓝鲸加的所谓高级服务器，其实就是一台独立的服务器，独享的服务器。理论上是比其他要强大。其他那些服务器是共享的带宽，所以晚上巨卡。有钱我还真想全部换，或者在加多台香港的独立，看看合不合适玩游戏。前期，就和蓝鲸一起折腾呗。最后谢谢你们的好评，真心感谢!!!!!短短一天，已经快90个5星，还有好多公测版的评论没公开，公测版是只有我才能看到的，谢谢你们！！！",
                "enTitle": "Official version of bug",
                "enContent": "After the official version went online, I found a lot of bugs. I tried to fix it at night. I will fix the existing problems as soon as possible. I also thank the big brothers who changed their comments. Thank you, I am sorry, I finished watching yesterday. It's a bit mad, the application is new, I may be a little looking forward to forgive me. There are also friends who have encountered bugs can send emails to me, so I am better to fix, because my mobile phone test is no problem before I go online, but there are too many Android models, only the online can really find the problem. Wait for me, if you find that the blue whale is not as good as the fast fish, you can wait for the blue whale to be repaired. The so-called advanced server added by the blue whale is actually a stand-alone server and an exclusive server. In theory, it is stronger than others. The other servers are shared bandwidth, so the night giant card. I really want to change all the money, or to add more independence to Hong Kong to see if it is suitable for playing games. In the early stage, I was tossed with the blue whale. Finally, thank you for your praise, thank you very much!!!!! In just one day, it’s already 90 stars and 5 stars. There are still a lot of public beta reviews. The public beta is only available to me. Thank you! ! !"
            },
            {
                "zhTitle": "蓝鲸的优化方向",
                "zhContent": "谢谢刚刚大兄弟提的建议，说如果23点看完全部广告，凌晨又要重新看一遍，这确实是一个问题，之前我也考虑过，只是鉴于目前没有登录系统，我也做不了统计，所以就只能这样先，不过我也想了其他方案，后面会做一些调整。\n 接下来蓝鲸的优化方向是这样\n 1、把目前遇到的Bug修复完上一版。\n 2、把全局功能优化好，重新加回来，这样就可以实现换Ip。\n 3、优化广告机制，比如说今天连续看完广告的，隔天就可以免看，或者少看，具体要看技术上怎么实现。不是我想让你们看多少广告，而是我觉得现在的广告机制是为了保护肯花时间的人有更好的服务器用，如果都是一样打开就能用，很容易造成拥挤，这样高级服务器其实就没有意义了，因为免广告，大家其实都会直接就跳过去选择高级服务器，这样累的还是我，本身就没有费用购买更多服务器，然后高级服务器还卡，你们都删了，剩下的大家都可以脑补，我不想我花了那么多时间的东西白费掉。或者哪位富二代突然发邮件告诉我说，给我打一个全年份，几十台高级服务器的费用，好了，那时候蓝鲸还有广告，我就和蓝鲸一个姓。",
                "enTitle": "Bluewhale optimization direction",
                "enContent": "Thank you for the advice of the big brother, saying that if you look at the full advertisement at 23 o'clock, you have to look back again in the early morning. This is indeed a problem. I have considered it before. Just because there is no login system, I can't do statistics, so I can't do statistics. It can only be like this first, but I also think about other options, and I will make some adjustments later. \n Next, the optimization direction of the blue whale is like this. \n 1. Fix the current bug to the previous version. \n 2, optimize the global function, add it back, so you can change Ip. \n 3, optimize the advertising mechanism, for example, today, after reading the advertisements in succession, you can watch it the next day, or watch it less, depending on how the technology is implemented. I don't think I want you to see how many advertisements, but I think the current advertising mechanism is to protect people who spend their time with better servers. If they are all open, they can be used easily, so it is easy to cause congestion. There is no point, because free of advertising, everyone will actually jump directly to select the advanced server, so tired or me, there is no cost to buy more servers, and then the advanced server card, you have deleted, the rest of everyone I can make up for it, I don't want to spend so much time on my time. Or which rich second generation suddenly sent an email telling me to give me a full year, dozens of advanced server fees, well, then blue whales have ads, I will be a surname with blue whales."
            }
        ]
    }
}
