{
    "status": true,
    "message": "",
    "data": {
        "info": [
            {
                "zhTitle": "问题总汇0419",
                "zhContent": "这能不能不要老问我搞那么多广告干什么，我真的很无奈啊！也请不老拿别人和蓝鲸比，你说别人好，别人方便，这我也认。但是你们说的广告多，这你为什么会觉得蓝鲸广告多？无非就是不肯花时间反而想得到更多。别忘了蓝鲸也是有一组免费不用看广告的服务器。如果你不想花点时间，你用免费的就好了。不花时间，你凭什么和我们肯花时间的人享有更多选择，你凭什么说支持蓝鲸。我做免费，我也要做有原则的免费，可能这样很招人讨厌，但是至少我留住了那些肯花时间的人，恰恰是这帮肯花时间的人，他们才是蓝鲸存活下去的支撑。我知道现在广告是有点多，所以我弄了所谓的秘技，我也发了说明，你也不肯花点时间去折腾，去弄明白原理，理解了，一天花不上一个广告的时间，就能解锁全部服务器，反倒老发邮件说，学学别人的应用做得多方便，我也老实告诉你，其实现在服务器的广告基本都会自动跳过的，因为广告商并没有给我太多广告资源，就是有广告的情况下，收益也是甚微，服务器类型的广告收益是最少的，但是我为什么还要这么设置，无非就是设置一个槛，区分用户，你付出更多时间，我给你更多选择，仅此而已。\n我就真的想不懂，为什么会在广告的问题上一直持续这么久，这你们不是更应该抱怨服务器不好，要求我增加功能才是真么，做为用户如果理解开发者，就应该用用户的角度去看待一个应用，UI上，操作上，去给我提意见。蓝鲸这类的应用，每天都是需要花销服务器来维护，才能持续，而且现在广告机制也在看有没有收益，能不能持续。世间安得两全法，不负如来不负卿？吐槽那么多，如果想简单解锁，就用秘技吧。蓝鲸也一样欢迎，因为你肯花时间去理解，去掌握，无广告的蓝鲸欢迎你使用。就不要做那种即不肯花时间去看广告，又不肯花时间去用秘技，而有时间发邮件和我说广告多的人，这种人网络我不喜欢，现实我也不喜欢。最后谢谢那些发邮件告诉我应用不稳定，告诉我应用Bug的朋友，谢谢你！\n\n以后问题会在这个公布栏进行反馈\n\n1、关于应用运行一段时间会断线问题。\n答：最近收到几个邮件说应用会运行一段时间断线，有的人说半个小时，有的人说一个小时内，有人说几十分钟，关于这个问题，你们遇到可以邮件反馈一下，具体写上什么手机，安卓版本多少，这样我可以排除什么问题，现在已知可能是速鱼留下来的Bug，之前速鱼设置过保护机制，应用运行一段时间会断开，但是之前速鱼设置是1个小时，所以可能是这个问题，具体等你们多反馈，我在整体排除一遍。\n\n2、关于服务器费用问题。\n答：收到几封邮件来说，我说会发公告告诉你们，现在一台普通服务器一个月的费用是20美金，因为共享带宽，所以大多数晚上是高峰期，会不稳定。高级服务器是独立的服务器，个人租的整台服务器，独享带宽，独享性能，一台一个月费用是120美金，所以大多数晚上如果蓝鲸用户少用的情况下，应该会比较稳定。但是网络这东西，谁知道呢。自己用的电信200M，一到下雨天，网络也异常慢，所以我不是说让大家理解我服务器慢，服务器烂不是我的借口，我是想让你们告诉我，有时候体验不好可以发邮件告诉我，我可以改进。我可以知道多少用户该配多少服务器比较合适，我的钱也是钱，也是靠上班挣来的，我只能满足一部分人。好了，我不哭穷，笑着笑着突然哭了。\n\n3、关于开发PC端和iOS问题。\n答：我只是一个弱小可怜又无助但很能吃的安卓程序猿，所以PC端我不懂怎么开发，对于iOS，我可能还有点点了解，所以iOS就后面看吧。\n\n4、关于全局\n答：前期稳定性基本ok了，接下来全局是我的一个重点的方向，全局做好后，就能真正体现每个服务器的价值了，真正实现隐藏本地IP功能，真正实现访问全球受限网站问题。等等我吧，全局可能会迟到，但全局不可能不到！\n\n5、关于手机有时候显示已连接，但是没有数据传输问题。\n答：这排除我会发公告说服务器维护的情况下，一般如果选择服务器后，显示已连接，但是没有数据传输，而且全部服务器都一样，这时候你只要重启一下手机。一般都是能解决。如果不能解决这个问题，请给我留言，一般我也解决不了！我只是陪你聊聊天，舒缓舒缓一下情绪！",
                "enTitle": "Problem summary 0419",
                "enContent": "In the future, the problem will be feedback in this bulletin board\n\n1, and the application will run for a period of time. \n A: I recently received several emails saying that the application will run for a period of time. Some people say that for half an hour, some people say that within an hour, some people say dozens of minutes. On this issue, you can get mail. Feedback, specifically what mobile phone, Android version, so I can rule out what problems, now known to be a bug left by the fast fish, before the speed fish set protection mechanism, the application will run for a while will be disconnected, but before The speed fish setting is 1 hour, so it may be this problem, specifically waiting for your feedback, I will exclude it in the whole. \n\n2, about server costs. \n A: I received a few emails, I said that I will send an announcement to tell you that the cost of a regular server for a month is 20 dollars. Because of the shared bandwidth, most nights are peak and unstable. The advanced server is a stand-alone server. The entire server is rented by individuals. It has exclusive bandwidth and exclusive performance. The cost per month is 120 dollars, so most of the night, if the blue whale users use less, it should be stable. But who knows about the Internet? I used the telecom 200M. When it rains, the network is also very slow, so I am not saying that everyone understands that my server is slow. The server is not an excuse for me. I want you to tell that sometimes you can send an email if you have a bad experience. I can improve. I can know how many users should match the number of servers, compare my money is also money, but also earned by going to work, I can only meet some people. Ok, I don't cry, I laugh and suddenly cry. \n\n3, about developing PC and iOS issues. \n A: I am just a small, poor and helpless but very good Android program, so I don't know how to develop on the PC side. For iOS, I may have some understanding, so iOS will look at it later. \n\n4, About the global \n A: The stability of the previous period is basically ok, then the global is a key direction of me. After the global is done, it can truly reflect the value of each server, and truly realize the hidden local IP. Features that truly enable access to globally restricted websites. Wait for me, the whole world may be late, but the whole world is impossible! \n\n5, About the phone sometimes shows that it is connected, but there is no data transmission problem. \n A: This excludes me from issuing an announcement that the server is maintained. Generally, if the server is selected, the connection is displayed, but there is no data transmission, and all the servers are the same. At this time, you only need to restart the phone. Generally can solve. If you can't solve this problem, please leave a message, generally I can't solve it! I just chat with you to soothe your mood!"
            },
            {
                "zhTitle": "反馈04-21",
                "zhContent": "不好意思，各位你们的邮件还有谷歌留言，我都没能及时回复，个人开发者请见谅，速鱼的邮件我能及时回复是因为，我手机可以看邮件，现在蓝鲸用的是全新的开发者账户，和之前的不想有关联，怕下次违规，我就永久封号，还有鉴于VPN这种东西，我需要格外的小心。\n\n关于掉线问题，我找到原因了，是因为之前速鱼设置了1小时的保护机制，蓝鲸在上面改了一些，所以导致现在蓝鲸会出现半个小时断线的问题。这个问题我会在下一个版本修复。修复完，我会沿用速鱼的一小时保护机制，这样可以让服务器更稳定，如果有需要用过超过1小时的用户，麻烦就重新搜索服务器，然后重新连接。目前如果小于半小时会断线的话，一般是手机的查杀问题，还有手机内存的优化问题，这个我无法让每部手机对蓝鲸的无缝兼容（安卓的型号实在太多了，好的公司自己都加入了一些安全设置，所以很多情况低于半小时的断线，一般是手机的问题）。\n\n关于广告问题，蓝鲸目前知道广告是多，但是都是趋向于需求的选择，需要就观看。理想是丰满的，但是这几天下来，你们的留言太多关于广告的问题了，以至于我有点动摇，有点怀疑这样是不是真的适合用户，这样是不是适合长期下去，脱离用户的体验，我现在这种方式真的合适么？真想你们谁有比较好的方式可以告诉我。\n\n关于秘技，秘技这几天有不少人找我要，回复邮件太累了，我一个人顾不了那么多，或者我可以把秘技继续公开在速鱼上面。速鱼26号就正式关闭服务器，到时候真怕一堆人对我不满，跑来蓝鲸骂我，这我也没办法，如果两边顾，可能都全部要倒。至于秘技，我觉得大家都可以学会，但是用不用就看自己情况，后面我也会减少秘技的步骤，优化秘技的方法，还有提供秘技的更多服务，我知道老老实实看广告太花时间了，所以我其实也挺鼓励用户用秘技，因为使用秘技和老老实实看广告给我带来的收益是一样的，但是可以节约了用户很多时间。\n\n关于小黄灯，呵~挺尴尬的事，今天朋友找我，我以为是要给我打款，然后他截了他的数据给我看，71个下载，还有12个卸载。我还是太年轻，把事情想得太理所当然，我以为蓝鲸现在每天有1千多人用，怎么说有30%，肯帮忙，两天基本就能满足他的要求。也罢，可能这种找资金的方式并不适合蓝鲸吧，现在我是寻求帮助，帮，我要感激，不帮，也是本分，可能这就是现实吧。我也答应继续帮他挂着，他也挺高兴的，因为他第一次自己上传软件，第一次有用户，第一次看到留言。后面他说要给我打款，我说等多一段时间吧。现在上服务器我也不知道上那个地区的服务器好，还有全局也没加进去，加不同地区的服务器也是一样，所以就等，后面我也特意去看了他的谷歌页面，真的太感谢你们了，好多熟悉的名字，里面有好多经常和我邮件交流的朋友，还有一个是速鱼开始帮助我最多的一位，他那时候叫他的主播朋友帮我推广，然后蓝鲸上线后，他也一直问我，要帮我推广，可能吧，那些帮你的，永远都肯帮你。最后感谢你们！。\n\n关于服务器，或许有了这笔额外的收入，你们想要我购买哪里的服务器，目前可能会选择香港、台湾。或者你们还有什么其他要求，可以留意，或者邮箱，不过可能也就1个月使用期限，后面就看蓝鲸的运营程度了。\n今天说这些有些酸，但是这几天下来，蓝鲸有那么多评价，而且总评分还能是5分，虽然有几个1星，还有2星，还有一些1星我举报后，谷歌帮忙给删了，还有一个同行帮我把1星改成5星。你们说蓝鲸有你们这么鼎力支持，你说我还奢求什么呢，我还抱怨什么呢，我唯有做的也只能慢慢来完事蓝鲸，让你们体验更好，后面请给我多一些时间，我把这些完善好。蓝鲸真的非常感谢你们的支持！谢谢！蓝鲸写在2019年4月21日。",
                "enTitle": "Feedback 04-21",
                "enContent": "Sorry, everyone emails and Google messages, I have not responded in time, personal developers please forgive me, I can reply to the quick fish mail because my mobile phone can see the mail, now the blue whale is brand new The developer account, I don't want to be associated with the previous ones, I am afraid of the next violation, I will be the permanent number, and in view of the VPN, I need to be extra careful. \n\nAbout the dropout problem, I found the reason. It was because the speed fish had set a one-hour protection mechanism, and the blue whale changed some above, so the blue whale will now have a half-hour disconnection problem. I will fix this problem in the next version. After the repair, I will follow the one-hour protection mechanism of the speed fish, which will make the server more stable. If you need to use the user for more than 1 hour, you will search the server again and reconnect. At present, if it is less than half an hour, it will be disconnected, it is usually the problem of mobile phone killing, and the optimization of mobile phone memory. I can't make each mobile phone seamlessly compatible with blue whales (Android models are too many, good The company itself has added some security settings, so many cases are less than half an hour of disconnection, which is generally a problem with mobile phones). \n\nAbout advertising, Blue Whale currently knows that there are many ads, but they all tend to be demanding and need to be watched. The ideal is full, but these days, your message is too much about the advertising problem, so that I am a little shaken, a little doubt whether this is really suitable for the user, is it suitable for the long-term, away from the user experience, Is this really right for me now? I really want you guys to have a better way to tell me. \n\nAbout secret techniques, cheats Many people have asked me for these days. The reply emails are too tired. I can't take care of them so much, or I can keep the secrets open on the speed fish. The speed fish officially shut down the server on the 26th. When I was afraid that a bunch of people were dissatisfied with me, I ran to the blue whale and yelled at me. I couldn’t help it. If both sides were concerned, they might all fall. As for the secret skills, I think everyone can learn, but I don't have to look at my own situation. Later, I will also reduce the steps of mystery, optimize the methods of secret technology, and provide more services for mystery. I know that I can honestly see the advertisement too. Time is up, so I actually encourage users to use secret techniques, because the benefits of using secret technology and honestly watching advertisements are the same, but it can save users a lot of time. \n\nAbout the little yellow light, oh~It’s quite awkward. Today, my friend is looking for me. I thought I was going to give me a money, then he cut off his data and showed it to me, 71 downloads, and 12 uninstallations. . I am still too young to think about things too much. I think that the blue whale is now used by more than 1,000 people every day. How to say that there are 30%, willing to help, basically meet his requirements in two days. Or maybe this way of finding money is not suitable for the blue whale. Now I am looking for help, help, I want to be grateful, not help, but also the duty, maybe this is the reality. I also promised to continue to help him hang, he is also very happy, because he first uploaded the software himself, the first time there are users, the first time I saw the message. Later he said that he would pay me money. I said that I will wait for a while. Now on the server, I don't know that the server in that area is good, and there is no global addition. Adding servers in different regions is the same, so I will wait, I will go to see his Google page later. Thank you very much. You, a lot of familiar names, there are a lot of friends who often communicate with me, and one who is the fastest fish to help me. He called his anchor friend to help me promote, then the blue whale went online. He also always asked me to help me promote, maybe, those who help you will always help you. Finally thank you! . \n\nAbout the server, maybe with this extra income, you want to buy the server where I am, I may choose Hong Kong, Taiwan. Or what other requirements do you have, you can pay attention to it, or the mailbox, but it may be a one-month period of use, and then you will see the operation level of the blue whale. \n Today said that these are a bit sour, but in the past few days, the blue whale has so many comments, and the total score can be 5 points, although there are a few 1 star, there are 2 stars, and some 1 star after I reported it. Google helped to delete it, and another colleague helped me change 1 star to 5 stars. You said that the blue whale has such strong support. You said that I still want something. What do I complain about? I can only do it slowly and finish the blue whale. Let you experience better. Please give me more behind. Some time, I perfected these. Blue Whale really appreciates your support! Thank you! The blue whale was written on April 21, 2019."
            },
            {
                "zhTitle": "如你所愿",
                "zhContent": "如你所愿，我把广告关了。蓝鲸苦，但蓝鲸不说。广告机制会改，改得让你无话可说。你至于说那么狠毒的话？没改广告机制之前，知道秘技的朋友。使用秘技，可以给蓝鲸增加收益。你们先记着秘技的精髓。后面我不会回邮件告知关于秘技的方法。以后增添服务器，全部都是基于秘技的方法上面，优先给知道秘技的使用。在全局加上来前，我会回复大家秘技的方法。等加了全局后，我就不会在告知。你们感谢那位恶言相对的朋友吧。\n\n我朋友给我钱了，他也说不用帮他推广了。几天下来，其实结果都知道，就没有必要了，服务器我也会在全局加上后，更新加上。04-24",
                "enTitle": "Hello world",
                "enContent": "Hello world！"
            },          
            {
                "zhTitle": "蓝鲸的优化方向",
                "zhContent": "谢谢刚刚大兄弟提的建议，说如果23点看完全部广告，凌晨又要重新看一遍，这确实是一个问题，之前我也考虑过，只是鉴于目前没有登录系统，我也做不了统计，所以就只能这样先，不过我也想了其他方案，后面会做一些调整。\n 接下来蓝鲸的优化方向是这样\n 1、把目前遇到的Bug修复完上一版。\n 2、把全局功能优化好，重新加回来，这样就可以实现换Ip。\n 3、优化广告机制，比如说今天连续看完广告的，隔天就可以免看，或者少看，具体要看技术上怎么实现。不是我想让你们看多少广告，而是我觉得现在的广告机制是为了保护肯花时间的人有更好的服务器用，如果都是一样打开就能用，很容易造成拥挤，这样高级服务器其实就没有意义了，因为免广告，大家其实都会直接就跳过去选择高级服务器，这样累的还是我，本身就没有费用购买更多服务器，然后高级服务器还卡，你们都删了，剩下的大家都可以脑补，我不想我花了那么多时间的东西白费掉。或者哪位富二代突然发邮件告诉我说，给我打一个全年份，几十台高级服务器的费用，好了，那时候蓝鲸还有广告，我就和蓝鲸一个姓。",
                "enTitle": "Bluewhale optimization direction",
                "enContent": "Thank you for the advice of the big brother, saying that if you look at the full advertisement at 23 o'clock, you have to look back again in the early morning. This is indeed a problem. I have considered it before. Just because there is no login system, I can't do statistics, so I can't do statistics. It can only be like this first, but I also think about other options, and I will make some adjustments later. \n Next, the optimization direction of the blue whale is like this. \n 1. Fix the current bug to the previous version. \n 2, optimize the global function, add it back, so you can change Ip. \n 3, optimize the advertising mechanism, for example, today, after reading the advertisements in succession, you can watch it the next day, or watch it less, depending on how the technology is implemented. I don't think I want you to see how many advertisements, but I think the current advertising mechanism is to protect people who spend their time with better servers. If they are all open, they can be used easily, so it is easy to cause congestion. There is no point, because free of advertising, everyone will actually jump directly to select the advanced server, so tired or me, there is no cost to buy more servers, and then the advanced server card, you have deleted, the rest of everyone I can make up for it, I don't want to spend so much time on my time. Or which rich second generation suddenly sent an email telling me to give me a full year, dozens of advanced server fees, well, then blue whales have ads, I will be a surname with blue whales."
            }
        ]
    }
}
