{
    "status": true,
    "message": "",
    "data": {
        "info": [{
                "zhTitle": "人无完人，谢谢信任！",
                "zhContent": "这今天莫名看到蓝鲸的某些排名已经飙到第二名，其实有点惊讶，蓝鲸的问题还那么多！还能有那么用户的青睐！真的非常感谢你们！蓝鲸连接问题一直存在，可能是速鱼那时候为了实现快速切换节点导致的，这几天一直在找原因，新版本优化可能明天就会上线。解决了小图标问题，还解决的华为用户容易闪退，奔溃问题，不过都是需要后面你们帮我测试，因为我自己只有一台烂红米测试机，这几天看了一下华为荣耀10，二手都要一千多。我默默的关了淘宝！假装自己不喜欢二手。还有也解决了蓝鲸显示已连接，但是没有网络数据的问题。至少我红米测试还是算正常，这些也是需要后面你们帮我测试！还有就是测试连接不上。麻烦不用骂我。其实骂我没多大用，因为我看着每天卸载的用户那么多，隔着屏幕我都觉得痛，真的不用骂我，卸载我心更痛。再者说说那些低星的留言吧，其实我人很敏感，那些是真的用户给我吐槽，我知道，那些是恶意我也知道。所以我想说抱歉，我也只能以恶制恶，今天有个给我留了2星的开发者，其实他伪装得不好，我看着他的留言我真的觉得挺搞笑的，应用做不好，可能就是人的问题吧，说话的逻辑都有问题，又如何把编程编好，再说，编故事都没有我厉害。还有本来今天想更新多一台香港服务器，后面凌晨过了，如果刷新你们又要重新看多一遍广告，我就没有，等明天上新版本我在一起更新吧。\n\n最后想说的~~人无完人，蓝鲸如此，谢谢信任！",
                "enTitle": "Hello world！",
                "enContent": "Hello world！"
            },{
                "zhTitle": "可能会上一个韩国服务器",
                "zhContent": "周末好卡，我自己一个人用的服务器也一样，打算再加多一个韩国高级服务器，这两天会更新，我还在看怎么购买。到时候可以试试网速怎么样，不好我就不用了。",
                "enTitle": "May increase a Korean server！",
                "enContent": "The network is not good on weekends. I use the same server myself. I plan to add one more Korean advanced server. These two days will be updated. I am still watching how to buy it. When I can try the speed of the network, I will not need it."
            },
                 {
                "zhTitle": "1.0.7重大更新!",
                "zhContent": "好累！终于解决了，连接的问题，大家可以更新试试，现在不会出现显示已连接，但是没有网络问题。还优化了图标、华为手机奔溃问题。希望新版本你们会喜欢。希望同行不用在恶意中伤。其实一直以来，我没有吹嘘过什么！我也从来没有说我的应用没有广告，我需要钱，我需要广告来维护！我希望做到大家都不反感广告，这不是我对大家承诺什么，而且我对我自己应用的要求，我需要在收益与体验做一个平衡，我也一直在尝试。至于连接问题，你们给差评，我也觉得很正常，毕竟你们看了几个可能给我带来不到几分钱收益的广告就觉得我欠你什么的人，我还能说什么呢？将心比心。我也非常感谢那些体验不好，然后给我留好评鼓励的人，我不会让你们失望的。我会坚持下去。1.07版本我就是来履行我的承诺，给你们带来更好的体验。蓝鲸广告很多！谢谢谅解~",
                "enTitle": "1.0.7 major update!",
                "enContent": "So tired! Finally solved, the connection problem, you can update and try, now there will be no display connection, but no network problems. It also optimized the icon and Huawei mobile phone crash. I hope that you will like the new version. I hope that my peers will not be malicious. In fact, I have never boasted anything! I have never said that my app has no ads, I need money, I need ads to maintain! I hope that everyone will not dislike advertising. This is not what I promise to everyone, and my requirements for my own application, I need to balance the benefits and experience, I have been trying. As for the connection problem, I feel that it is normal for you to give a bad review. After all, if you look at a few advertisements that may bring me less than a few cents of income, what do you think I owe you, what else can I say? Think of your heart. I am also very grateful to those who have a bad experience and then give me praise and encouragement, I will not let you down. I will stick to it. Version 1.07 I am here to fulfill my promise and bring you a better experience. Blue whale advertising a lot! Thank you for your understanding~."
            },
                 {
                "zhTitle": "显示已连接，无数据！",
                "zhContent": "好多人反馈，显示已连接，但是数据连接是0kb，这时候试试去首页关闭搜索开关，重新搜索服务器试试，如果还是一样，建议重启一下手机，这是bug，我会在下一版本看看怎么修复。升级到1.0.7已经解决这问题。",
                "enTitle": "Display connected, no data!",
                "enContent": "A lot of people feedback, the display is connected, but the data connection is 0kb, this time try to go to the home page to close the search switch, try again to search the server, if it is still the same, it is recommended to restart the phone, this is a bug, I will look at the next version How to fix.Upgrading to 1.0.7 has solved this problem."
            },
          {
                "zhTitle": "跳过广告秘技",
                "zhContent": "facebook恢复了，正常了，地址：https://www.facebook.com/Bluewhalevip或者搜索bluewhalevpn\n\n秘技公布在上面，需要的去看。谢谢了。",
                "enTitle": "Skip advertising cheats",
                 "enContent": "Facebook resumed, normal, address: https://www.facebook.com/Bluewhalevip\n\n secret technology announced above, need to see. Thank you."
            },
          {
                "zhTitle": "真香",
                "zhContent": "前几天还在抱怨Facebook，今天发现真香！欢迎各位喷子到facebook到一战！开发累了，好想找人吵吵架~233333~！！地址：https://www.facebook.com/Bluewhalevip\n\n秘技公布在上面，需要的去看。谢谢了。",
                "enTitle": "Facebook can feedback！",
                 "enContent": "If the software encounters a problem, you can go to facebook feedback, I will give you the first reply, thank you.\n\n address: https://www.facebook.com/Bluewhalevip"
            }
        ]
    }
}
