{
    "status": true,
    "message": "",
    "data": {
        "info": [{
                "zhTitle": "关于秘技",
                "zhContent": "秘技现在不用发邮件了，我搞了一个博客站点，地址：www.bluewhalevpn.com，密码：bluewhale123。需要的上去看，我看看后面更新一下图文说明，还有台中服务器挂了，我在和服务器商交涉中，造成不便，实在抱歉。\n最后感谢你们一路相伴.谢谢你们！",
                "enTitle": "Sorry！",
                "enContent": "During this time, the network is unstable, and many servers are slow. I suggest you use the advanced server. If you want to use the advanced server, you can check out my blog, but currently only Chinese, I will increase the English version of the cheats in the future. The following is my blog address: www.bluewhalevpn.com, password: bluewhale123. Thank you for trying to understand and all your support. I really appreciate it."
            },{
                "zhTitle": "建议大家重启一下手机",
                "zhContent": "更新了一下服务器！如果遇到无法连接，建议大家重启一下手机。",
                "enTitle": "Update server！",
                "enContent": "Unable to connect, it is recommended to restart the phone！"
            },{
                "zhTitle": "关于三天登陆问题！",
                "zhContent": "我看了回复好多人反馈说三天登陆开启高级服务器是无效，登陆好多天都无法开启高级服务器？麻烦有成功的人给我留言，或者没有成功的也给我留言。我本人测试是成功的。我还不清楚是哪个环节出了问题。没道理啊。",
                "enTitle": "New version coming soon！",
                "enContent": "I'm coming! The new version will be released soon! The delay display is coming soon! Increase the node connection test, the old version opens the advanced node and returns together, multiple choices. I was really sorry during this time. I was a little busy at work. During this time, I just did a simple maintenance on the server. I didn't even have time to read it. Hurry up this damn June! July! I hope you will be better to me!!"
            },{
                "zhTitle": "不务正业的我！！！",
                "zhContent": "不务正业的我，今天又把蓝鲸更新了！加了一个小游戏（emmmmm！最近在学游戏开发，最新版本已经上线1.14），本来想说和免广告机制一起上线，开始的想法是这样的，说每周游戏排名前50名，就获得一个星期的免广告，功能全开，没有过多繁琐的操作，无奈到后面发现能力有限。就先把游戏上了，后面再学习学习，看这个排名怎么上。已经7月了！蓝鲸已经上线有几个月了，我坚持下来了！可是蓝鲸的网速却不尽人意。一个网速不好的VPN。UI做得再好，使用体验再好，他也不是一个合格的产品。免费之路很漫长！谢谢相伴！",
                "enTitle": "2048！",
                "enContent": "2048 games online (updated to version 1.14)!"
            }
        ]
    }
}
